In [1]:
import pandas as pd
import numpy as np

- *The M5 dataset, generously made available by Walmart, involves the unit sales of various products sold in the USA, organized in the form of grouped time series. More specifically, the dataset involves the unit sales of 3,049 products, classified in 3 product categories (Hobbies, Foods, and Household) and 7 product departments, in which the above-mentioned categories are disaggregated.  The products are sold across ten stores, located in three States (CA, TX, and WI)*

- **CA - California, WI - Wisconsin, TX - Texas**

**calendar.csv**
- Contains information about the dates the products are sold.

In [2]:
df = pd.read_csv('data/calendar.csv')

In [3]:
df.head()

,date,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
0,2011-01-29,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0
1,2011-01-30,11101,Sunday,2,1,2011,d_2,NaN,NaN,NaN,NaN,0,0,0
2,2011-01-31,11101,Monday,3,1,2011,d_3,NaN,NaN,NaN,NaN,0,0,0
3,2011-02-01,11101,Tuesday,4,2,2011,d_4,NaN,NaN,NaN,NaN,1,1,0
4,2011-02-02,11101,Wednesday,5,2,2011,d_5,NaN,NaN,NaN,NaN,1,0,1

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1969 entries, 0 to 1968
Data columns (total 14 columns):
date            1969 non-null object
wm_yr_wk        1969 non-null int64
weekday         1969 non-null object
wday            1969 non-null int64
month           1969 non-null int64
year            1969 non-null int64
d               1969 non-null object
event_name_1    162 non-null object
event_type_1    162 non-null object
event_name_2    5 non-null object
event_type_2    5 non-null object
snap_CA         1969 non-null int64
snap_TX         1969 non-null int64
snap_WI         1969 non-null int64
dtypes: int64(7), object(7)
memory usage: 215.4+ KB

In [9]:
df['event_type_1'].value_counts()

Religious    55
National     52
Cultural     37
Sporting     18
Name: event_type_1, dtype: int64

In [11]:
#df['d']

In [13]:
df['snap_CA'].value_counts()

0    1319
1     650
Name: snap_CA, dtype: int64

- It is a federal nutrition program that helps you stretch your food budget and buy healthy food. SNAP benefits can be used to purchase food at grocery stores, convenience stores, and some farmers' markets and co-op food programs. ... SNAP is a federal entitlement program.

- **Maybe to add feature special day for event occuring days**
- **Maybe later to add feature related to black swans**

**Sell_prices.csv**
- Contains information about the price of the products sold per store and date.

In [15]:
df = pd.read_csv('data/sell_prices.csv')

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6841121 entries, 0 to 6841120
Data columns (total 4 columns):
store_id      object
item_id       object
wm_yr_wk      int64
sell_price    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 208.8+ MB

In [17]:
df.head()

  store_id        item_id  wm_yr_wk  sell_price
0     CA_1  HOBBIES_1_001     11325        9.58
1     CA_1  HOBBIES_1_001     11326        9.58
2     CA_1  HOBBIES_1_001     11327        8.26
3     CA_1  HOBBIES_1_001     11328        8.26
4     CA_1  HOBBIES_1_001     11329        8.26

**wm_yr_wk** - id of the week

**sales_train_validation.csv**
- Contains the historical daily unit sales data per product and store.

In [18]:
df = pd.read_csv('data/sales_train_validation.csv')

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30490 entries, 0 to 30489
Columns: 1919 entries, id to d_1913
dtypes: int64(1913), object(6)
memory usage: 446.4+ MB

In [25]:
df.iloc[-1]

id          FOODS_3_827_WI_3_validation
item_id                     FOODS_3_827
dept_id                         FOODS_3
cat_id                            FOODS
store_id                           WI_3
state_id                             WI
d_1                                   0
d_2                                   0
d_3                                   0
d_4                                   0
d_5                                   0
d_6                                   0
d_7                                   0
d_8                                   0
d_9                                   0
d_10                                  0
d_11                                  0
d_12                                  0
d_13                                  0
d_14                                  0
d_15                                  0
d_16                                  0
d_17                                  0
d_18                                  0
d_19                                  0
d_20                                  0
d_21                                  0
d_22                                  0
d_23                                  0
d_24                                  0
                       ...
d_1884                                0
d_1885                                5
d_1886                                7
d_1887                                3
d_1888                                1
d_1889                                4
d_1890                                3
d_1891                                3
d_1892                                1
d_1893                                2
d_1894                                3
d_1895                                2
d_1896                                0
d_1897                                0
d_1898                                1
d_1899                                0
d_1900                                0
d_1901                                0
d_1902                                0
d_1903                                0
d_1904                                0
d_1905                                0
d_1906                                0
d_1907                                0
d_1908                                0
d_1909                                0
d_1910                                0
d_1911                                0
d_1912                                0
d_1913                                0
Name: 30489, Length: 1919, dtype: object

-	item_id: The id of the product.
-	dept_id: The id of the department the product belongs to.
-	cat_id: The id of the category the product belongs to.
-	store_id: The id of the store where the product is sold.
-	state_id: The State where the store is located.
-	d_1, d_2, …, d_i, … d_1941: The number of units sold at day i, starting from 2011-01-29.